local char_map = {
	-- lowercase
	a = {"𝕒", "ａ", "𝗮", "𝙖"},
	b = {"𝕓", "ｂ", "𝗯", "𝙗"},
	c = {"𝕔", "ｃ", "𝗰", "𝙘"},
	d = {"𝕕", "ｄ", "𝗱", "𝙙"},
	e = {"𝕖", "ｅ", "𝗲", "𝙚"},
	f = {"𝕗", "ｆ", "𝗳", "𝙛"},
	g = {"𝕘", "ｇ", "𝗴", "𝙜"},
	h = {"𝕙", "ｈ", "𝗵", "𝙝"},
	i = {"𝕚", "ｉ", "𝗶", "𝙞"},
	j = {"𝕛", "ｊ", "𝗷", "𝙟"},
	k = {"𝕜", "ｋ", "𝗸", "𝙠"},
	l = {"𝕝", "ｌ", "𝗹", "𝙡"},
	m = {"𝕞", "ｍ", "𝗺", "𝙢"},
	n = {"𝕟", "ｎ", "𝗻", "𝙣"},
	o = {"𝕠", "ｏ", "𝗼", "𝙤"},
	p = {"𝕡", "ｐ", "𝗽", "𝙥"},
	q = {"𝕢", "ｑ", "𝗾", "𝙦"},
	r = {"𝕣", "ｒ", "𝗿", "𝙧"},
	s = {"𝕤", "ｓ", "𝘀", "𝙨"},
	t = {"𝕥", "ｔ", "𝘁", "𝙩"},
	u = {"𝕦", "ｕ", "𝘂", "𝙪"},
	v = {"𝕧", "ｖ", "𝘃", "𝙫"},
	w = {"𝕨", "ｗ", "𝘄", "𝙬"},
	x = {"𝕩", "ｘ", "𝘅", "𝙭"},
	y = {"𝕪", "ｙ", "𝘆", "𝙮"},
	z = {"𝕫", "ｚ", "𝘇", "𝙯"},
	-- uppercase
	A = {"𝔸", "Ａ", "𝗔", "𝘼"},
	B = {"𝔹", "Ｂ", "𝗕", "𝘽"},
	C = {"ℂ", "Ｃ", "𝗖", "𝘾"},
	D = {"𝔻", "Ｄ", "𝗗", "𝘿"},
	E = {"𝔼", "Ｅ", "𝗘", "𝙀"},
	F = {"𝔽", "Ｆ", "𝗙", "𝙁"},
	G = {"𝔾", "Ｇ", "𝗚", "𝙂"},
	H = {"ℍ", "Ｈ", "𝗛", "𝙃"},
	I = {"𝕀", "Ｉ", "𝗜", "𝙄"},
	J = {"𝕁", "Ｊ", "𝗝", "𝙅"},
	K = {"𝕂", "Ｋ", "𝗞", "𝙆"},
	L = {"𝕃", "Ｌ", "𝗟", "𝙇"},
	M = {"𝕄", "Ｍ", "𝗠", "𝙈"},
	N = {"ℕ", "Ｎ", "𝗡", "𝙉"},
	O = {"𝕆", "Ｏ", "𝗢", "𝙊"},
	P = {"ℙ", "Ｐ", "𝗣", "𝙋"},
	Q = {"ℚ", "Ｑ", "𝗤", "𝙌"},
	R = {"ℝ", "Ｒ", "𝗥", "𝙍"},
	S = {"𝕊", "Ｓ", "𝗦", "𝙎"},
	T = {"𝕋", "Ｔ", "𝗧", "𝙏"},
	U = {"𝕌", "Ｕ", "𝗨", "𝙐"},
	V = {"𝕍", "Ｖ", "𝗩", "𝙑"},
	W = {"𝕎", "Ｗ", "𝗪", "𝙒"},
	X = {"𝕏", "Ｘ", "𝗫", "𝙓"},
	Y = {"𝕐", "Ｙ", "𝗬", "𝙔"},
	Z = {"ℤ", "Ｚ", "𝗭", "𝙕"},
	-- numbers
	["0"] = {"𝟶", "０", "𝟬", "𝟬"},
	["1"] = {"𝟷", "１", "𝟭", "𝟭"},
	["2"] = {"𝟸", "２", "𝟮", "𝟮"},
	["3"] = {"𝟹", "３", "𝟯", "𝟯"},
	["4"] = {"𝟺", "４", "𝟰", "𝟰"},
	["5"] = {"𝟻", "５", "𝟱", "𝟱"},
	["6"] = {"𝟼", "６", "𝟲", "𝟲"},
	["7"] = {"𝟽", "７", "𝟳", "𝟳"},
	["8"] = {"𝟾", "８", "𝟴", "𝟴"},
	["9"] = {"𝟿", "９", "𝟵", "𝟵"}
}

local styles = {
	["-"] = 0,
	["brain damage"] = 1,
	["monospace"] = 2,
	["bold"] = 3,
	["bold italic"] = 4
}

local funny_text_combo = ui.new_combobox("MISC", "Miscellaneous", "Funny Text", "-", "brain damage", "monospace", "bold", "bold italic")

client.set_event_callback("string_cmd", function(e)
	local text = e.text
	local cmd, msg = text:match("^(.-) (.*)$")

	if ((cmd == "say" or cmd == "say_team") and msg ~= nil and msg ~= "") then
		local new_msg = {}
		local selected_style = ui.get(funny_text_combo)
		local style_index = styles[selected_style]
		
		for funny_text in msg:gmatch("[^%s]+") do
			if style_index > 0 then
				funny_text = funny_text:gsub(".", function(c)
					return char_map[c] and char_map[c][style_index] or c
				end)
			end
			table.insert(new_msg, funny_text)
		end

		e.text = cmd .. " " .. table.concat(new_msg, " ")
	end
end)